export default {
  errors: {
    '10001': '请检查请求参数是否正确',
    '20001': '请检查请求参数是否正确',
    '30001': '请检查请求参数是否正确',

    '20003': '授权失败，请检查配置授权参数和服务提供商状态',
    '40001': '路径校验失败，请确认路径是否存在或路径填写是否规范',
    '40002': '当前路径下的可用存储空间不足',
    '40003': '当前路径下文件夹不为空',
    '40004': '模型文件迁移失败',
    '40005': '当前路径权限被拒绝，请检查文件夹权限',
    '40006': 'mcp添加失败， 请重试！',

    service_error: '服务出错，请检查奥丁服务',
    network: '网络异常，请检查网络连接',
    byze_unavailable: '奥丁服务不可用，请确认奥丁服务启动状态',
  },
  modelInfo: {
    noSelectModel: '请先选择模型，再体验。',
  },
  mcpInfo: {
    maxSelectMcp: '为保障服务稳定运行与优质体验，建议您选择的MCP工具不要超过5个。',
    requiredMcp: '暂无添加好的MCP，请添加后，再体验',
  },
};
